Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAR176.atdf
      <value-group caption="DMA Buffer Descriptor Packet Complete Interrupt Signal Enable bit" name="SQI1INTSIGEN__PKTCOMPISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Bus Error Interrupt Signal Enable bit" name="SQI1INTSIGEN__DMAEISE">
         <value caption="Interrupt signal is enabled" name="" value="0x1" />
         <value caption="Interrupt signal is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SQI Clock Output Delay bits" name="SQI1TAPCON__CLKOUTDLY">
         <value caption="16 taps added on clock output" name="" value="0xf" />
         <value caption="15 taps added on clock output" name="" value="0xe" />
         <value caption="2 taps added on clock output" name="" value="0x1" />
         <value caption="1 tap added on clock output" name="" value="0x0" />
      </value-group>
      <value-group caption="SQI Data Output Delay bits" name="SQI1TAPCON__DATAOUTDLY">
         <value caption="16 taps added on clock output" name="" value="0xf" />
         <value caption="15 taps added on clock output" name="" value="0xe" />
         <value caption="2 taps added on clock output" name="" value="0x1" />
         <value caption="1 tap added on clock output" name="" value="0x0" />
      </value-group>
      <value-group caption="SQI Clock Input Delay bits" name="SQI1TAPCON__SDRCLKINDLY">
         <value caption="64 taps added on clock input" name="" value="0x3f" />
         <value caption="63 taps added on clock input" name="" value="0x3e" />
         <value caption="2 taps added on clock input" name="" value="0x1" />
         <value caption="1 tap added on clock input" name="" value="0x0" />
      </value-group>
      <value-group caption="Number of Status Bytes bits" name="SQI1MEMSTAT__STATBYTES">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Status command/read is 2 bytes long" name="" value="0x2" />
         <value caption="Status command/read is 1 byte long" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Command/Read Lane Mode bits" name="SQI1MEMSTAT__STATTYPE">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Status command and read are executed in Quad Lane mode" name="" value="0x2" />
         <value caption="Status command and read are executed in Dual Lane mode" name="" value="0x1" />
         <value caption="Status command and read are executed in Single Lane mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Statis Bit Position in Flash bit" name="SQI1MEMSTAT__STATPOS">
         <value caption="BUSY bit position is bit 7 in status register" name="" value="0x1" />
         <value caption="BUSY bit position is bit 0 in status register" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Initialization 1 Command Type bits" name="SQI1XCON3__INIT1TYPE">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="INIT1 commands are sent in Quad Lane mode" name="" value="0x2" />
         <value caption="INIT1 commands are sent in Dual Lane mode" name="" value="0x1" />
         <value caption="INIT1 commadns are sent in Single Lane mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Initialization 1 Command Count bits" name="SQI1XCON3__INIT1COUNT">
         <value caption="INIT1CMD3, INIT1CMD2, and INIT1CMD3 are sent." name="" value="0x3" />
         <value caption="INIT1CMD1 and INIT1CMD2 are sent, but INIT1CMD3 is still pending." name="" value="0x2" />
         <value caption="INIT1CMD1 is sent, but INIT1CMD2 and INIT1CMD3 are still pending." name="" value="0x1" />
         <value caption="No commands are sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Initialization 1 Command Status Check bit" name="SQI1XCON3__INIT1SCHECK">
         <value caption="Check the status after executing the INIT1 command" name="" value="0x1" />
         <value caption="Do not check the status" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Initialization 2 Command Type bits" name="SQI1XCON4__INIT2TYPE">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="INIT2 commands are sent in Quad Lane mode" name="" value="0x2" />
         <value caption="INIT2 commands are sent in Dual Lane mode" name="" value="0x1" />
         <value caption="INIT2 commands are sent in Single Lane mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Initialization 2 Command Count bits" name="SQI1XCON4__INIT2COUNT">
         <value caption="INIT2CMD1, INIT2CMD2, and INIT2CMD3 are sent" name="" value="0x3" />
         <value caption="INIT2CMD1 and INIT2CMD2 are sent, but INIT2CMD3 is still pending" name="" value="0x2" />
         <value caption="INIT2CMD1 is sent, but INIT2CMD2 and INIT2CMD3 are still pending" name="" value="0x1" />
         <value caption="No commands are sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Initialization 2 Command Status Check bit" name="SQI1XCON4__INIT2SCHECK">
         <value caption="Check the status after executing the INIT2 command" name="" value="0x1" />
         <value caption="Do not check the status" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02141" name="TMR1" version="2">
      <register-group name="TMR1">
         <register caption="TYPE A TIMER CONTROL REGISTER" name="T1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T1CON__TCS" />
            <bitfield caption="Timer External Clock Input Synchronization Selection bit" mask="0x00000004" name="TSYNC" values="T1CON__TSYNC" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000030" name="TCKPS" values="T1CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T1CON__TGATE" />
            <bitfield caption="Timer1 External Clock Selection bits" mask="0x00000300" name="TECS" values="T1CON__TECS" />
            <bitfield caption="Asynchronous Timer Write in Progress bit" mask="0x00000800" name="TWIP" values="T1CON__TWIP" />
            <bitfield caption="Asynchronous Timer Write Disable bit" mask="0x00001000" name="TWDIS" values="T1CON__TWDIS" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T1CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T1CON__ON" />
         </register>
         <register caption="Timer Count Register Bits" name="TMR1" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR1" />
         </register>
