Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAR176.atdf
         <register caption="USB DMA Channel 5 Memory Address Register" name="USBDMA5A" offset="0x248" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 5 Count Register" name="USBDMA5N" offset="0x24c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 6 Control Register" name="USBDMA6C" offset="0x254" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA6C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA6C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA6C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA6C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA6C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA6C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 6 Memory Address Register" name="USBDMA6A" offset="0x258" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 6 Count Register" name="USBDMA6N" offset="0x25c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 7 Control Register" name="USBDMA7C" offset="0x264" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA7C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA7C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA7C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA7C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA7C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA7C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 7 Memory Address Register" name="USBDMA7A" offset="0x268" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 7 Count Register" name="USBDMA7N" offset="0x26c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 8 Control Register" name="USBDMA8C" offset="0x274" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA8C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA8C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA8C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA8C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA8C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA8C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 8 Memory Address Register" name="USBDMA8A" offset="0x278" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 8 Count Register" name="USBDMA8N" offset="0x27c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB Endpoint 1 Request Packet Count Register (Host Mode Only)" name="USBE1RPC" offset="0x304" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT" />
         </register>
         <register caption="USB Endpoint 2 Request Packet Count Register (Host Mode Only)" name="USBE2RPC" offset="0x308" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT" />
         </register>
         <register caption="USB Endpoint 3 Request Packet Count Register (Host Mode Only)" name="USBE3RPC" offset="0x30c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT" />
         </register>
         <register caption="USB Endpoint 4 Request Packet Count Register (Host Mode Only)" name="USBE4RPC" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT" />
         </register>
         <register caption="USB Endpoint 5 Request Packet Count Register (Host Mode Only)" name="USBE5RPC" offset="0x314" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT" />
         </register>
         <register caption="USB Endpoint 6 Request Packet Count Register (Host Mode Only)" name="USBE6RPC" offset="0x318" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT" />
         </register>
         <register caption="USB Endpoint 7 Request Packet Count Register (Host Mode Only)" name="USBE7RPC" offset="0x31c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT" />
         </register>
         <register caption="USB Double Packet Buffer Disable Register" name="USBDPBFD" offset="0x340" rw="RW" size="4">
            <bitfield caption="RX Endpoint 1 Double Packet Buffer Disable bits" mask="0x00000002" name="EP1RXD" values="USBDPBFD__EP1RXD" />
            <bitfield caption="RX Endpoint 2 Double Packet Buffer Disable bits" mask="0x00000004" name="EP2RXD" values="USBDPBFD__EP2RXD" />
            <bitfield caption="RX Endpoint 3 Double Packet Buffer Disable bits" mask="0x00000008" name="EP3RXD" values="USBDPBFD__EP3RXD" />
            <bitfield caption="RX Endpoint 4 Double Packet Buffer Disable bits" mask="0x00000010" name="EP4RXD" values="USBDPBFD__EP4RXD" />
            <bitfield caption="RX Endpoint 5 Double Packet Buffer Disable bits" mask="0x00000020" name="EP5RXD" values="USBDPBFD__EP5RXD" />
            <bitfield caption="RX Endpoint 6 Double Packet Buffer Disable bits" mask="0x00000040" name="EP6RXD" values="USBDPBFD__EP6RXD" />
            <bitfield caption="RX Endpoint 7 Double Packet Buffer Disable bits" mask="0x00000080" name="EP7RXD" values="USBDPBFD__EP7RXD" />
            <bitfield caption="TX Endpoint 1 Double Packet Buffer Disable bits" mask="0x00020000" name="EP1TXD" values="USBDPBFD__EP1TXD" />
            <bitfield caption="TX Endpoint 2 Double Packet Buffer Disable bits" mask="0x00040000" name="EP2TXD" values="USBDPBFD__EP2TXD" />
            <bitfield caption="TX Endpoint 3 Double Packet Buffer Disable bits" mask="0x00080000" name="EP3TXD" values="USBDPBFD__EP3TXD" />
            <bitfield caption="TX Endpoint 4 Double Packet Buffer Disable bits" mask="0x00100000" name="EP4TXD" values="USBDPBFD__EP4TXD" />
            <bitfield caption="TX Endpoint 5 Double Packet Buffer Disable bits" mask="0x00200000" name="EP5TXD" values="USBDPBFD__EP5TXD" />
            <bitfield caption="TX Endpoint 6 Double Packet Buffer Disable bits" mask="0x00400000" name="EP6TXD" values="USBDPBFD__EP6TXD" />
            <bitfield caption="TX Endpoint 7 Double Packet Buffer Disable bits" mask="0x00800000" name="EP7TXD" values="USBDPBFD__EP7TXD" />
         </register>
         <register caption="USB Timing Control Register 1" name="USBTMCON1" offset="0x344" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TUCH" />
            <bitfield mask="0xFFFF0000" name="THHSRTN" />
         </register>
         <register caption="USB Timing Control Register 2" name="USBTMCON2" offset="0x348" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="THSBT" />
         </register>
         <register caption="USB Link Power Management Control Register 1" name="USBLPMR1" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="LNKSTATE" />
            <bitfield mask="0x000000F0" name="HIRD" />
            <bitfield caption="Remote Wake-up Enable bit" mask="0x00000100" name="RMTWAK" values="USBLPMR1__RMTWAK" />
            <bitfield mask="0x0000F000" name="ENDPOINT" />
            <bitfield caption="LPM Transition to the L1 State bit" mask="0x00010000" name="LPMXMT" values="USBLPMR1__LPMXMT" />
            <bitfield caption="LPM Resume bit" mask="0x00020000" name="LPMRES" values="USBLPMR1__LPMRES" />
            <bitfield caption="LPM Enable bits (" mask="0x000C0000" name="LPMEN" values="USBLPMR1__LPMEN" />
            <bitfield caption="LPM-only Transaction Setting bit" mask="0x00100000" name="LPMNAK" values="USBLPMR1__LPMNAK" />
            <bitfield caption="LPM Time-out Interrupt Enable bit" mask="0x01000000" name="LPMTOIE" values="USBLPMR1__LPMTOIE" />
            <bitfield caption="LPM STALL Interrupt Enable bit" mask="0x02000000" name="LPMSTIE" values="USBLPMR1__LPMSTIE" />
            <bitfield caption="LPM NYET Interrupt Enable bit" mask="0x04000000" name="LPMNYIE" values="USBLPMR1__LPMNYIE" />
            <bitfield caption="LPM Acknowledge Interrupt Enable bit" mask="0x08000000" name="LPMACKIE" values="USBLPMR1__LPMACKIE" />
            <bitfield caption="LPM Resume Interrupt Enable bit" mask="0x10000000" name="LPMRESIE" values="USBLPMR1__LPMRESIE" />
            <bitfield caption="LPM Error Interrupt Enable bit" mask="0x20000000" name="LPMERRIE" values="USBLPMR1__LPMERRIE" />
         </register>
         <register caption="USB Link Power Management Control Register 2" name="USBLPMR2" offset="0x364" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LPMST" />
            <bitfield mask="0x00000002" name="LPMNY" />
            <bitfield mask="0x00000004" name="LPMACK" />
            <bitfield mask="0x00000008" name="LPMNC" />
            <bitfield mask="0x00000010" name="LPMRES" />
            <bitfield mask="0x00000020" name="LPMERR" />
            <bitfield mask="0x00007F00" name="LPMFADDR" />
         </register>
      </register-group>
      <value-group caption="Suspend Mode Enable bit" name="USBCSR0__SUSPEN">
         <value caption="Suspend mode is enabled" name="" value="0x1" />
         <value caption="Suspend mode is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Suspend Mode status bit" name="USBCSR0__SUSPMODE">
         <value caption="The USB module is in Suspend mode" name="" value="0x1" />
         <value caption="The USB module is in Normal operations" name="" value="0x0" />
      </value-group>
      <value-group caption="Resume from Suspend control bit" name="USBCSR0__RESUME">
         <value caption="Generate Resume signaling when the device is in Suspend mode" name="" value="0x1" />
         <value caption="Stop Resume signaling" name="" value="0x0" />
      </value-group>
      <value-group caption="Module Reset Status bit" name="USBCSR0__RESET">
         <value caption="Reset signaling is present on the bus" name="" value="0x1" />
         <value caption="Normal module operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Hi-Speed Mode Status bit" name="USBCSR0__HSMODE">
         <value caption="Hi-Speed mode successfully negotiated during USB reset" name="" value="0x1" />
         <value caption="Module is not in Hi-Speed mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Hi-Speed Enable bit" name="USBCSR0__HSEN">
         <value caption="The USB module will negotiate for Hi-Speed mode when the device is reset by the hub" name="" value="0x1" />
         <value caption="Module only operates in Full-Speed mode" name="" value="0x0" />
      </value-group>
